<template>
<div class="time-line-all">
    <div class="time-line-header"><h1>中国式现代化的发展历程</h1></div>
    <main class="time-line-main">
        <timeline-carousel
            :timelineList="timelineList"
            :carouselList="carouselList"
            carouselsShow
            loop
            enterActiveClass
            mouseEvent
            class="time-line-body"
        />
    </main>

</div>

</template>

<script>
export default {
    name: "TimelineComponent",
    data() {
        return {
            timelineList: [
                {
                    id: 1,
                    text: '1978'
                },
                {
                    id:2,
                    text: '1979'
                },
                {
                    id:3,
                    text: '1987'
                },
                {
                    id:4,
                    text: '1997'
                },
                {
                    id:5,
                    text: '2012'
                },
                {
                    id:6,
                    text: '2021-1'
                },
                {
                    id:7,
                    text: '2022-10-16'
                },
                {
                    id:8,
                    text: '2023-2'
                },
                {
                    id:9,
                    text: '2023-4-21'
                },
                {
                    id:10,
                    text: '2023-6-1'
                },
                {
                    id:11,
                    text: '2023-10-18'
                },
                {
                    id:12,
                    text: '2024-3-6'
                },
                {
                    id:13,
                    text: '2024-3-20'
                }



            ],
            carouselList: [
                {
                    id: 1,
                    img: require('../../assets/images/timelist/1978.jpg'),
                    title: '改革开放和社会主义现代化建设新时期',
                    info: '1978年党的十一届三中全会的召开，实现了新中国成立以来党的历史上具有深远意义的伟大转折，开启了改革开放和社会主义现代化的伟大征程。'
                },
                {
                    id: 2,
                    img: require('../../assets/images/timelist/1979.jpg'),
                    title: '正式提出“中国式的现代化”',
                    info:'1979年3月21日，在会见英中文化协会执委会代表团时，邓小平同志提出了“中国式的四个现代化”的概念。两天后，邓小平同志把“中国式的四个现代化”进一步概括为“中国式的现代化”。“中国式的现代化”是一个全新的概念，不仅包括已有的现代农业、现代工业、现代国防和现代科学技术，而且强调必须从中国的基本国情、实际和特点出发，量力而行，不再追求工业、农业、科学技术、国防现代化方面的高指标，而是侧重于人民生活水平的提高和富裕程度。'

                },
                {
                    id: 3,
                    img: require('../../assets/images/timelist/1987.jpg'),
                    title: '提出基本实现现代化的“三步走”战略',
                    info:'党的十三大进一步提出基本实现现代化的“三步走”战略，继续提出要“把我国建设成为富强、民主、文明的社会主义现代化国家”，并提出“分三步走”基本实现社会主义现代化的发展战略。至此，党的十三大首次提出了“基本实现现代化”的概念，在内涵上也比“四个现代化”更为丰富，并提出了相应的具体标准。'
                },
                {
                    id: 4,
                    img: require('../../assets/images/timelist/1997.jpg'),
                    title: '提出“两个一百年”的奋斗目标',
                    info:'中共十五大把邓小平理论确定为党的指导思想，把依法治国确定为治国的基本方略，把坚持公有制为主体、多种所有制经济共同发展，坚持按劳分配为主体、多种分配方式并存，确定为中国在社会主义初级阶段的基本经济制度和分配制度，第一次提出“两个一百年”的奋斗目标，这次大会对建设有中国特色社会主义事业的跨世纪发展作出了全面部署，具有重大的现实意义和深远的历史意义。'
                },
                {
                    id: 5,
                    img: require('../../assets/images/timelist/2012.jpg'),
                    title: '中国特色社会主义进入新时代：成功推进和拓展了“中国式现代化”',
                    info:'党的十八大以来，我们党不断实现理论和实践上的创新突破，成功推进和拓展了中国式现代化。中国化时代化的马克思主义最新理论成果——习近平新时代中国特色社会主义思想，指明了中国式现代化道路的新路径，开创了社会主义现代化国家建设新局面。'
                },
                {
                    id: 6,
                    img:require('../../assets/images/timelist/2021.jpg'),
                    title: '提出我国现代化的五个方面 ',
                    info:'2021年1月，习近平总书记在省部级主要领导干部学习贯彻党的十九届五中全会精神专题研讨班上进一步指出，我国现代化是人口规模巨大的现代化，是全体人民共同富裕的现代化，是物质文明和精神文明相协调的现代化，是人与自然和谐共生的现代化，是走和平发展道路的现代化。'
                },
                {
                    id: 7,
                    img:require('../../assets/images/timelist/2022_10-16.jpg'),
                    title: '正式提出“中国式现代化”——中共二十大',
                    info:'习近平代表第十九届中央委员会向大会作报告，习近平指出，从现在起，中国共产党的中心任务就是团结带领全国各族人民全面建成社会主义现代化强国、实现第二个百年奋斗目标，以中国式现代化全面推进中华民族伟大复兴。前进道路上，必须牢牢把握重大原则：坚持和加强党的全面领导，坚持中国特色社会主义道路，坚持以人民为中心的发展思想，坚持深化改革开放，坚持发扬斗争精神 李克强主持大会 2340名代表和特邀代表出席大会'
                },
                {
                    id: 8,
                    img:require('../../assets/images/timelist/2023_2.jpg'),
                    title: '中国式现代化的积极推进',
                    info:'新进中央委员会的委员、候补委员和省部级主要领导干部学习贯彻习近平新时代中国特色社会主义思想和党的二十大精神研讨班7日上午在中央党校（国家行政学院）开班。中共中央总书记、国家主席、中央军委主席习近平在开班式上发表重要讲话强调，概括提出并深入阐述中国式现代化理论，是党的二十大的一个重大理论创新，是科学社会主义的最新重大成果。中国式现代化是我们党领导全国各族人民在长期探索和实践中历经千辛万苦、付出巨大代价取得的重大成果，我们必须倍加珍惜、始终坚持、不断拓展和深化。'
                },
                {
                    id: 9,
                    img: require('../../assets/images/timelist/2023_4.jpg'),
                    title: '中国式现代化的世界追求',
                    info:'4月21日，国家主席习近平向在上海“世界会客厅”举办的“中国式现代化与世界”蓝厅论坛致贺信。习近平指出，实现现代化是近代以来中国人民的不懈追求，也是世界各国人民的共同追求。一个国家走向现代化，既要遵循现代化的一般规律，更要符合本国实际、具有本国特色。中国共产党团结带领全国各族人民，经过长期艰辛探索找到了符合中国国情的发展道路，正在以中国式现代化全面推进强国建设、民族复兴。中方愿同各国一道，努力以中国式现代化新成就为世界发展提供新机遇，为人类探索现代化道路和更好社会制度提供新助力，推动构建人类命运共同体。'
                },
                {
                    id: 10,
                    img: require('../../assets/images/timelist/2023_6.jpg'),
                    title: '中国式现代化的领导核心',
                    info:'6月1日出版的第11期《求是》杂志将发表中共中央总书记、国家主席、中央军委主席习近平的重要文章《中国式现代化是中国共产党领导的社会主义现代化》。文章强调，党的二十大报告明确指出：“中国式现代化，是中国共产党领导的社会主义现代化。”这是对中国式现代化定性的话，是管总、管根本的。党的领导直接关系中国式现代化的根本方向、前途命运、最终成败。文章指出，党的领导决定中国式现代化的根本性质。党的性质宗旨、初心使命、信仰信念、政策主张决定了中国式现代化是社会主义现代化，而不是别的什么现代化。我们党始终高举中国特色社会主义伟大旗帜，坚定不移地走中国特色社会主义道路，确保中国式现代化在正确的轨道上顺利推进。'
                },
                {
                    id: 11,
                    img: require('../../assets/images/timelist/2023_10.jpg'),
                    title: '中国式现代化的国际合作',
                    info:'习近平出席第三届“一带一路”国际合作高峰论坛开幕式并发表主旨演讲。习近平指出，今年是我提出共建“一带一路”倡议10周年。提出这一倡议的初心，是借鉴古丝绸之路，以互联互通为主线，同各国加强政策沟通、设施联通、贸易畅通、资金融通、民心相通，为世界经济增长注入新动能，为全球发展开辟新空间，为国际经济合作打造新平台。'
                },
                {
                    id: 12,
                    img: require('../../assets/images/timelist/2024_3.jpg'),
                    title: '中国式现代化的共识凝聚',
                    info:'中共中央总书记、国家主席、中央军委主席习近平6日下午看望了参加全国政协十四届二次会议的民革、科技界、环境资源界委员，并参加联组会，听取意见和建议。他强调，人民政协各党派、各团体、各族各界各方面人士要围绕中共二十大提出的重大战略任务和中央经济工作会议部署，深入调查研究，积极建言资政，广泛凝聚共识，助力中国式现代化建设。'
                },
                {
                    id: 13,
                    img: require('../../assets/images/timelist/2024_3_2.jpg'),
                    title: '中国式现代化的生动实践',
                    info:'中共中央总书记、国家主席、中央军委主席习近平20日下午在湖南省长沙市主持召开新时代推动中部地区崛起座谈会并发表重要讲话。他强调，中部地区是我国重要粮食生产基地、能源原材料基地、现代装备制造及高技术产业基地和综合交通运输枢纽，在全国具有举足轻重的地位。要一以贯之抓好党中央推动中部地区崛起一系列政策举措的贯彻落实，形成推动高质量发展的合力，在中国式现代化建设中奋力谱写中部地区崛起新篇章。'
                }
            ]
        }
    }
}
</script>

<style>

.time-line-all{

}
.time-line-body{

}
.time-line-header{
    display: flex;
    justify-content: center;
}
.time-line-main{
    width: 100%;
    height: 100%;
}
.time-line-body{
    margin:0;
    padding:0;
}
.time-line-body span{
    padding: 0;
}
.time-line-body .full-width {
    height: 50vh;
}
.time-line-body .slider{
    height: 50vh;
}

.time-line-body .timeline{
    margin-top: 10vh;
}
</style>